SlidingMesh_AMI/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1.4607E-05;   // Kinematic viscosity calculated from Fluent

//rho 1.225
//mu 1.7894e-05
//nu 0.0000146

// ************************************************************************* //
