SlidingMesh_AMI/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value		uniform 0;
    }

    inlet
    {
        type            zeroGradient;
        
    }

    frontAndBackPlanes
    {
        type            empty;
    }

    /*MRFinner1
    {
        type            cyclicAMI;
    }


    MRFouter1
    {
        type            cyclicAMI;
    }

    MRFinner2
    {
        type            cyclicAMI;
    }


    MRFouter2
    {
        type            cyclicAMI;
    }*/
    
    MRFOuter1
    {
        type            cyclicAMI;
        value		$internalField;
    }

    MRFOuter2
    {
        type            cyclicAMI;
        value		$internalField;
    }

    rotWall
    {
    	type		zeroGradient;
    }
    
    upper_wall
    {
    	type		zeroGradient;
    }
    
    lower_wall
    {
    	type		zeroGradient;
    }
    

   
}

// ************************************************************************* //
